app/views/courses/show.html.erb

SELECT "exercises".* FROM "exercises" WHERE "exercises"."course_id" = 1
SELECT "quizzes".* FROM "quizzes" WHERE "quizzes"."course_id" = 1
SELECT "videos".* FROM "videos" WHERE "videos"."course_id" = 1
---
              <div id="materials">
               <% (1..@course.videos.length+@course.quizzes.length+@course.exercises.length).each do |i|%>