app/controllers/choices_controller.rb

SELECT "choices".* FROM "choices" WHERE "choices"."id" = ? LIMIT 1  [["id", "1"]]
---
	def show
 		@choice = Choice.find(params[:id])

INSERT INTO "choices" ("body", "created_at", "index", "isAnswer", "quiz_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["body", "Test"], ["created_at", Sat, 29 Jun 2013 09:54:26 UTC +00:00], ["index", 1], ["isAnswer", nil], ["quiz_id", 1], ["updated_at", Sat, 29 Jun 2013 09:54:26 UTC +00:00]]
---
	def create
	    @quiz = Quiz.find(params[:quiz_id])
	    @choice = @quiz.choices.create(params[:choice])

SELECT "choices".* FROM "choices" WHERE "choices"."id" = ? LIMIT 1  [["id", "1"]]
---
	def edit
	    @quiz = Quiz.find(params[:quiz_id])
  		@choice = Choice.find(params[:id])

SELECT "choices".* FROM "choices" WHERE "choices"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "choices" SET "body" = '590', "isAnswer" = 'f', "updated_at" = '2013-06-30 03:17:23.297056' WHERE "choices"."id" = 1
---
	def update
	    @quiz = Quiz.find(params[:quiz_id])
		@choice = Choice.find(params[:id])
		@choice.attributes = params[:choice]
		if @choice.save

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "choices".* FROM "choices" WHERE "choices"."quiz_id" = 1
---
	def index
		@course =Course.find(params[:course_id])
		@quiz = Quiz.find(params[:quiz_id])
		@choices = @quiz.choices.all