app/controllers/courses_controller.rb

INSERT INTO "courses" ("created_at", "intro", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 29 Jun 2013 04:01:28 UTC +00:00], ["intro", nil], ["title", nil], ["updated_at", Sat, 29 Jun 2013 04:01:28 UTC +00:00]]
---
	def create
  		@course = Course.new(params[:course])
  		@course.save

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "8"]]
UPDATE "courses" SET "title" = 'Java大冒险', "intro" = '让你打败Java', "updated_at" = '2013-06-30 04:39:57.610697' WHERE "courses"."id" = 1
---
	def update
		@course = Course.find(params[:id])
		@course.attributes = params[:course]
		if @course.save