app/controllers/exercises_controller.rb

	def new
	    @course = Course.find(params[:course_id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]

	def show
 		@exercise = Exercise.find(params[:id])
---
SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = ? LIMIT 1  [["id", "1"]]

	def create
	    @course = Course.find(params[:course_id])
	    @exercise = @course.exercises.create(params[:exercise])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "exercises" ("answer", "course_id", "created_at", "question", "updated_at") VALUES (?, ?, ?, ?, ?)  [["answer", "hohohoho"], ["course_id", 1], ["created_at", Sat, 29 Jun 2013 10:54:28 UTC +00:00], ["question", "lalalala"], ["updated_at", Sat, 29 Jun 2013 10:54:28 UTC +00:00]]

	def edit
	    @course = Course.find(params[:course_id])
  		@exercise = Exercise.find(params[:id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = ? LIMIT 1  [["id", "1"]]

	def update
	    @course = Course.find(params[:course_id])
		@exercise = Exercise.find(params[:id])
		@exercise.attributes = params[:exercise]
		if @exercise.save
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "exercises" SET "orderNum" = 2, "updated_at" = '2013-06-30 03:08:33.345092' WHERE "exercises"."id" = 1

	def check
		@course = Course.find(params[:course_id])
		@exercise =Exercise.find(params[:exercise_id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = ? LIMIT 1  [["id", "1"]]

	def index
		@course = Course.find(params[:course_id])
		@exercises = @course.exercises.all
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "exercises".* FROM "exercises" WHERE "exercises"."course_id" = 1