app/controllers/quizzes_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]
---
	def new
	    @course = Course.find(params[:course_id])

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "quizzes" ("answer", "course_id", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["answer", "12"], ["course_id", 1], ["created_at", Sat, 29 Jun 2013 08:31:56 UTC +00:00], ["title", "Quiz One"], ["updated_at", Sat, 29 Jun 2013 08:31:56 UTC +00:00]]
---
	def create
	    @course = Course.find(params[:course_id])
	    @quiz = @course.quizzes.create(params[:quiz])

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]
---
	def edit
	    @course = Course.find(params[:course_id])

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "choices".* FROM "choices" WHERE "choices"."quiz_id" = 1
---
	def check
		@course = Course.find(params[:course_id])
		@quiz =Quiz.find(params[:quiz_id])
		@choices = @quiz.choices
		@result = true
		@choices.each do |choice|

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]
---
	def update
	    @course = Course.find(params[:course_id])

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "quizzes".* FROM "quizzes" WHERE "quizzes"."course_id" = 1
---
	def index
		@course = Course.find(params[:course_id])
		@quizzes = @course.quizzes.all