app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "fname", "lname", "password", "robotName", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def create
  		@user = User.new(params[:user])
  		@user.save