app/controllers/videos_controller.rb

	def new
	    @course = Course.find(params[:course_id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]

	def create
	    @course = Course.find(params[:course_id])
	    @video = @course.videos.create(params[:video])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "videos" ("course_id", "created_at", "description", "img", "orderNum", "title", "updated_at", "url") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

	def edit
	    @course = Course.find(params[:course_id])
  		@video = Video.find(params[:id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", "1"]]

	def update
	    @course = Course.find(params[:course_id])
		@video = Video.find(params[:id])
		@video.attributes = params[:video]
		if @video.save
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "videos" SET "title" = 'Java 第一课', "description" = 'Java', "url" = 'http://xiexieshi.com/video/Coderobot%20-%20class%201%20-%20Large.m4v', "updated_at" = '2013-06-30 04:40:45.608296' WHERE "videos"."id" = 1

	def index
		@course = Course.find(params[:course_id])
		@videos = @course.videos.all
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "videos".* FROM "videos" WHERE "videos"."course_id" = 1